{
  "session_id": "demo_dailies_2025_10_03",
  "utterances": [
    {
      "ts": "00:00:00",
      "speaker": "Cameron",
      "text": "All right, okay, guys, thank you so much for jumping on. We're going to talk about this demo project with the animation and cuts here. How you guys doing? You guys have a good week so far?"
    },
    {
      "ts": "00:00:12",
      "speaker": "Lars",
      "text": "Doing well. Good week."
    },
    {
      "ts": "00:00:15",
      "speaker": "Cameron",
      "text": "Nice."
    },
    {
      "ts": "00:00:16",
      "speaker": "Cameron",
      "text": "Okay, so let's start here with HSM, satl, 0010. This is one of uh Sonia's shots. We're going to look at some of the lighting real quick. So let's jump in here. umm. First thing that pops out to me, Sonia is, I think you did a really great job with the sun. uhh. The stars are looking good in the background and the animation of the droid is looking really, really good. Do you have anything to add here with regards to the lighting pass?"
    },
    {
      "ts": "00:00:52",
      "speaker": "Sonia",
      "text": "Yeah, my team is still working on the reflection. We don't know how big to make it right now. And right now it's not moving at all, so I think it looks a little janky"
    },
    {
      "ts": "00:01:01",
      "speaker": "Cameron",
      "text": "copy that. Okay, yeah, that makes a ton of sense. Let me, let me make a note of that real quick."
    },
    {
      "ts": "00:01:11",
      "speaker": "Cameron",
      "text": "Okay, so"
    },
    {
      "ts": "00:01:13",
      "speaker": "Cameron",
      "text": "let's jump in. Keep me posted on roadblocks, by the way. Sonia, that's, that's, that's, that looks really good right now, but"
    },
    {
      "ts": "00:01:21",
      "speaker": "Sonia",
      "text": "yeah, definitely."
    },
    {
      "ts": "00:01:23",
      "speaker": "Cameron",
      "text": "All right, Lars, let's jump in and look at your compositing pass real quick."
    },
    {
      "ts": "00:01:25",
      "speaker": "Lars",
      "text": "Yeah, for sure."
    },
    {
      "ts": "00:01:26",
      "speaker": "Cameron",
      "text": "This is HSM, S, A, T, L, O, O, 15. First things that jump out to me is that the galaxy is looking really good. What are you thinking with regards to, like, the helmet?"
    },
    {
      "ts": "00:01:39",
      "speaker": "Lars",
      "text": "Yeah, dude, on second pass here. I kind of feel like the reflection on his visor is a little distracting. Let me see if me and my team can grade that down a little bit or matte it out. I'm happy to take another pass at it"
    },
    {
      "ts": "00:01:50",
      "speaker": "Cameron",
      "text": "Nice."
    },
    {
      "ts": "00:01:53",
      "speaker": "Lars",
      "text": "Also, I'm kind of seeing that his eye whites are getting a little lost against the background. I'm gonna try to up that contrast locally for you."
    },
    {
      "ts": "00:02:02",
      "speaker": "Cameron",
      "text": "Okay, yeah, cool. Yeah, that that, that actually sounds great. Yeah, I'm just noticing that now myself, it's, it's looking good. I I'm, it's definitely passing in terms of my believability, but sounds like you have some internal notes on your end to to address. Okay, yeah. Also, keep me posted on roadblocks there."
    },
    {
      "ts": "00:02:28",
      "speaker": "Lars",
      "text": "Copy."
    },
    {
      "ts": "00:02:29",
      "speaker": "Cameron",
      "text": "Let's jump into Griffin. Let's see. This is HSM, satl, oh, oh, 20. This one is going to be your effects pass, looking specifically at the asteroid hit. Cool. First things that jump out to me is it's looking a little linear there. What are you thinking?"
    },
    {
      "ts": "00:02:53",
      "speaker": "Griffin",
      "text": "Yeah, it's a little linear. I'll add some turbulence and break it up if you'd like."
    },
    {
      "ts": "00:02:59",
      "speaker": "Cameron",
      "text": "Okay, yeah, nice. That would be sweet. I like the color. I think the first first pass is looking good. We could definitely give it a couple more rounds here."
    },
    {
      "ts": "00:03:10",
      "speaker": "Griffin",
      "text": "Do you think the color fall off from yellow to red is a bit abrupt?"
    },
    {
      "ts": "00:03:14",
      "speaker": "Cameron",
      "text": "Yeah, that's a good point. Actually, I'm seeing that now here"
    },
    {
      "ts": "00:03:18",
      "speaker": "Griffin",
      "text": "I can add some cooler tones at the base if we want."
    },
    {
      "ts": "00:03:21",
      "speaker": "Cameron",
      "text": "yeah, yeah, actually, yeah. I'm just looking at frame at frame at frame like 1050 or something."
    },
    {
      "ts": "00:03:32",
      "speaker": "Sonia",
      "text": "We lost your screen share for a second there."
    },
    {
      "ts": "00:03:34",
      "speaker": "Griffin",
      "text": "Oh, yeah he's back up though."
    },
    {
      "ts": "00:03:36",
      "speaker": "Cameron",
      "text": "Thanks. Okay, yeah, I think, I think, like something, like 1015, or something could work with it."
    },
    {
      "ts": "00:03:45",
      "speaker": "Griffin",
      "text": "Okay, and maybe we add some additional motion blur at the flame streak, sell the speed a little bit?"
    },
    {
      "ts": "00:03:49",
      "speaker": "Cameron",
      "text": "Wait, yeah, actually, going back to that,"
    },
    {
      "ts": "00:03:52",
      "speaker": "Cameron",
      "text": "actually, yeah, I'm seeing that too. That's it. Okay."
    },
    {
      "ts": "00:03:54",
      "speaker": "Griffin",
      "text": "You see it?"
    },
    {
      "ts": "00:03:56",
      "speaker": "Cameron",
      "text": "All good ideas, guys. We're on fire today. This is looking great. Sounds good. Yeah, keep me posted on Road blocks. I'll make a note of that internally as well. And okay, so jumping back now we've got an animation pass of our main character here doing sort of like some somersaults through space."
    },
    {
      "ts": "00:04:18",
      "speaker": "Sonia",
      "text": "We were trying to make him look a bit weightless, but his joints seem a little stiff. I think we have to loosen up the joints a bit and maybe adjust the timing of his tumble. What do you think?"
    },
    {
      "ts": "00:04:32",
      "speaker": "Cameron",
      "text": "Yeah, I'm seeing the same, the same on my end. I think it's also like his expression is not reading for me very well.
    },
    {
      "ts": "00:04:44",
      "speaker": "Sonia",
      "text": "Mmm."
    },
    {
      "ts": "00:04:45",
      "speaker": "Cameron",
      "text": "I think we can definitely do another pass at just like his facials. I feel like there's, there could be some work there. And then last but not least, I feel like the the ship in the background could also read a bit better. I just feel like it. At the moment, it's getting, like, covered by by our droid in the foreground. And I kind of want to, kind of want to stay on that for a little longer so we can see all the things in the scene."
    },
    {
      "ts": "00:05:09",
      "speaker": "Sonia",
      "text": "Yeah. It kind of looks like both of them in the back look a little flat."
    },
    {
      "ts": "00:05:14",
      "speaker": "Cameron",
      "text": "Yeah, yeah."
    },
    {
      "ts": "00:05:17",
      "speaker": "Cameron",
      "text": "What are you what are you seeing on there?"
    },
    {
      "ts": "00:05:21",
      "speaker": "Sonia",
      "text": "Both of them just look. They look too two dimensional."
    },
    {
      "ts": "00:05:25",
      "speaker": "Cameron",
      "text": "Two dimensional? Okay, cool, all right. Well, I'm making another that as well and keeping posted on road blocks."
    },
    {
      "ts": "00:05:34",
      "speaker": "Cameron",
      "text": "Cool. So that was we are up to"
    },
    {
      "ts": "00:05:39",
      "speaker": "Cameron",
      "text": "Lars again. This is HSM, satl, oh, oh, 50."
    },
    {
      "ts": "00:05:48",
      "speaker": "Lars",
      "text": "Yeah."
    },
    {
      "ts": "00:05:49",
      "speaker": "Cameron",
      "text": "Can we look at that? We got some somersaulting. This kind of, like, reminds me of, like, gravity. I don't know if you guys, you guys, saw gravity, but it's like, it's giving like a gravity,"

    {
      "ts": "00:06:00",
      "speaker": "Lars",
      "text": "yeah, I think that's what the team kind of had in mind when they were pulling this together. I think that was a big influence. But, you know, I'm kind of seeing here, the color balance between him and the BG feels a bit mismatched. I think I should maybe warm him up in the next pass. I don't know what you think on that one."
    },
    {
      "ts": "00:06:18",
      "speaker": "Cameron",
      "text": "Yeah, I think so too. This one might actually be something to ship over to Sonia's team as well, and just check in with her. I feel like she'll be able to give some feedback as well on on sort of the the somersaulting and how the lighting will play on the face a little bit better..."
    },
    {
      "ts": "00:06:36",
      "speaker": "Lars",
      "text": "Totally, I feel like, Yes, her team is probably best positioned to work on that. I'm gonna jump in with one more thing here. I'm kind of feeling that his depth cueing is missing, you know, I'm not sure if you guys feel like that either."
    },
    {
      "ts": "00:06:51",
      "speaker": "Griffin",
      "text": "Yeah."
    },
    {
      "ts": "00:06:52",
      "speaker": "Lars",
      "text": "But, you know, I'll circle back up with my team to add in some subtle atmospheric haze here, just to push the scale a little bit..."
    },
    {
      "ts": "00:06:58",
      "speaker": "Griffin",
      "text": "Get to work on that, please."
    },
    {
      "ts": "00:06:59",
      "speaker": "Lars",
      "text": "Yeah, yeah, I'm seeing that was a little bit off right now. Yeah, happy to work on that on the next pass."
    },
    {
      "ts": "00:07:05",
      "speaker": "Cameron",
      "text": "Awesome."
    },
    {
      "ts": "00:07:06",
      "speaker": "Cameron",
      "text": "All right. Great job. Team. Okay, we've got we've got one more here. We've got Griffin's shot. It's HSM, S, A, T, L, O, O, 6, zero. It's like 14 frames pretty quick, but we just have, like, a quick, it's like a early pass at animation here. And, oh, I'm sorry, that's my mistake. It's the effects the shooting of the lasers, I think, so this is early stages. It's just the blocking of where the lasers should be going. This looks good. What are you feeling on your end? Griff..."
    },
    {
      "ts": "00:07:39",
      "speaker": "Griffin",
      "text": "They definitely read a little flat. I can layer in more parallax and flicker to get some depth if you want."
    },
    {
      "ts": "00:07:46",
      "speaker": "Cameron",
      "text": "Yeah, I think that's great next steps. I think some good parallax, a little bit of flicker. Yeah, you're right there at the moment. They're just kind of, you know, still early stages. But I think that's a great route to success there."
    },
    {
      "ts": "00:08:01",
      "speaker": "Griffin",
      "text": "yeah, and maybe it's missing some occlusion shadows."
    },
    {
      "ts": "00:08:06",
      "speaker": "Cameron",
      "text": "Yeah, yeah, definitely. I see that too. Let's, let's-"
    },
    {
      "ts": "00:08:10",
      "speaker": "Griffin",
      "text": " I can add some contact smoke if you want."
    },
    {
      "ts": "00:08:13",
      "speaker": "Cameron",
      "text": "I think on the contact smoke and the occlusion shadows, if I look back here and we look at Sonia's earlier pass, at the droid. I think, what am I looking at? Here it was. HSM, satl, oh, oh, 10. Her shot is looking like pretty polished at this point. So I wonder if maybe the two of you can-"
    },
    {
      "ts": "00:08:37",
      "speaker": "Griffin",
      "text": "yeah, she's pretty good."
    },
    {
      "ts": "00:08:41",
      "speaker": "Cameron",
      "text": "If you guys want to collaborate on, collaborate on, on, just, just bringing that to final I have to go back here and just take a look at an earlier shot. That's one of the things we outlined for this meeting."
    },
    {
      "ts": "00:08:54",
      "speaker": "Griffin",
      "text": "Yeah,"
    },
    {
      "ts": "00:08:54",
      "speaker": "Griffin",
      "text": "So I'm just gonna do that real quick, and it's looking, looking good, all right, guys, I think that's that's kind of it. Are you guys feeling good about today? And you guys need anything jump out immediately for the week's work?"
    },
    {
      "ts": "00:09:12",
      "speaker": "Lars",
      "text": "Felt like the feedback was solid. I think I have a solid go forward plan, but defer to the rest of the team here."
    },
    {
      "ts": "00:09:19",
      "speaker": "Griffin",
      "text": "Yeah, I agree. And if there's any roadblocks, we'll let you know."
    },
    {
      "ts": "00:09:22",
      "speaker": "Lars",
      "text": "yeah, for sure."
    },
    {
      "ts": "00:09:24",
      "speaker": "Sonia",
      "text": "yeah, it seems pretty straightforward."
    },
    {
      "ts": "00:09:25",
      "speaker": "Lars",
      "text": "All right, guys, thanks for jumping on. This is this was awesome. I appreciate it. Have a great week."
    }
  ]
}
